index.org
#+title: MAT5939-03 ACM Computing Seminar – Fall 2018
#+name: Zhifeng Deng
#+options: html-postamble:nil toc:nil name:nil
#+options: H:3 num:0
#+options: with-fixed-width:yes
#+html_head: <link rel="stylesheet" type="text/css" href="css/main.css">
#+html: <div id="main">
#+html_mathjax: path:"https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=Tex-AMS-MML_HTMLorMML"

* Course Information [[./syllabus.html][(syllabus)]]
| *Time & Place:* | Monday 18:45-20:00, LOV 102              |
| *Instructor:*   | Zhifeng Deng                             |
| *Office Hours:* | Tues/Thurs 10:30-12:00 or by appointment |
| *Email:*        | [[mailto:zdeng@math.fsu.edu?subject=MAT5939 ... ][zdeng@math.fsu.edu]]                       |
* Resources
** Programming Language Guides
+ [[./resources/langs/cpp/][C++ guide]] ([[./resources/langs/cpp/index.pdf][pdf]])
+ [[./resources/langs/fortran/][Fortran guide]] ([[./resources/langs/fortran/index.pdf][pdf]])
** Programming assignment resources
+ [[./resources/prog/assignment-template.zip][Programming assignment template]] (Read the README!)
+ [[./resources/prog/example-assignment.zip][Example programming assignment and solution]]
** Programming environment setup
+ [[./Linux.txt][Setup Windows Subsystem for Linux]]
Useful links: [[https://solarianprogrammer.com/2017/04/15/install-wsl-windows-subsystem-for-linux][Setup Subsystem]], [[https://solarianprogrammer.com/2017/04/16/windows-susbsystem-for-linux-xfce-4][Setup GUI]]
