index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MAT5939-03 ACM Computing Seminar – Fall 2018</title>
<!-- 2018-10-15 Mon 17:27 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="css/main.css">
</head>
<body>
<div id="content">
<h1 class="title">MAT5939-03 ACM Computing Seminar – Fall 2018</h1>
<div id="main">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Course Information <a href="./syllabus.html">(syllabus)</a></h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>Time &amp; Place:</b></td>
<td class="left">Monday 18:45-20:00, LOV 102</td>
</tr>

<tr>
<td class="left"><b>Instructor:</b></td>
<td class="left">Zhifeng Deng</td>
</tr>

<tr>
<td class="left"><b>Office Hours:</b></td>
<td class="left">Tues/Thurs 10:30-12:00 or by appointment</td>
</tr>

<tr>
<td class="left"><b>Email:</b></td>
<td class="left"><a href="mailto:zdeng@math.fsu.edu?subject=MAT5939%20...%20">zdeng@math.fsu.edu</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Resources</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Programming Language Guides</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="./resources/langs/cpp/">C++ guide</a> (<a href="./resources/langs/cpp/index.pdf">pdf</a>)
</li>
<li><a href="./resources/langs/fortran/">Fortran guide</a> (<a href="./resources/langs/fortran/index.pdf">pdf</a>)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Programming assignment resources</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="./resources/prog/assignment-template.zip">Programming assignment template</a> (Read the README!)
</li>
<li><a href="./resources/prog/example-assignment.zip">Example programming assignment and solution</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Programming environment setup</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="./Linux.txt">Setup Windows Subsystem for Linux</a>
</li>
</ul>
<p>
Useful links: <a href="https://solarianprogrammer.com/2017/04/15/install-wsl-windows-subsystem-for-linux">Setup Subsystem</a>, <a href="https://solarianprogrammer.com/2017/04/16/windows-susbsystem-for-linux-xfce-4">Setup GUI</a>
</p>
</div>
</div>
</div>
