index.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Assignments</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="center" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="center">Week</th>
<th scope="col" class="left">Assignment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="center">1 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-08-27 Mon&gt;</span></span></td>
<td class="left">1. Read the Programming assignment resources carefully.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">2. Install g++ or other compiler you prefer, create and compile helloworld.cpp.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">3 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-09-10 Mon&gt;</span></span></td>
<td class="left"><a href="https://en.wikipedia.org/wiki/Basel_problem">Basel problem</a></td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">IMPORTANT: Do \(S_N\) in single precision and \(\frac{\pi^2}{6}\) in double precision.</td>
</tr>

<tr>
<td class="center">Assignment 1</td>
<td class="left">So that you have your \(R_N = \frac{\pi^2}{6}-double(S_N)\) in double precision.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Basel problem asks for the precise summation of the infinite series:</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">$$\sum\limits_{n=1}^{\infty}\frac{1}{n^2}$$</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">The answer is known as \(\frac{\pi^2}{6}\)</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Now, consider the truncated sum</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">$$S_N=\sum\limits_{n=1}^{N} \frac{1}{n^2}$$</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">and the remainder term \(R_N=\frac{\pi^2}{6}-S_N\). Derive a bound for \(R_N\) of \(N\)</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Write a code to compute \(S_N,R_N\) with given \(N\). Then pick 5 proper \(N\) and run</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">it. Collect your result and do a logplot with \((N,R_N)\). Make comments on the</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">bound you derived and the result from your code:</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Is it a tight bound?</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Any comment on the order of the bound(power of \(N\))?</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Note: Feel free to use more than 5 \(N\) if you can. For example, if you are</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">familiar with output to file process, you may run your code iteratively and output</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">all results to a file.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">You may use any software for plotting.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">You may also plot your bound on the figure for illustration.</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center">4 <span class="timestamp-wrapper"><span class="timestamp">&lt;2018-09-17 Mon&gt;</span></span></td>
<td class="left">Follower problem</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">Assignment 2</td>
<td class="left">In social networking sites like Facebook, users with follower relationship creates</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">a complicated oriented graph structure. Let \(B\to A\) denotes \(B\) follows \(A\),</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">and suppose \(C\to B\), \(B\to A\), we call \(C\) a sub-follower of \(A\).</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Given all follower relationship of \(N\) users in <a href="./resources/data/follower.txt">follower.txt</a>, write a code to</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">accomplish 2 tasks:</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">1. Determined if a user \(B\) is a follower or sub-follower (no need to distinguish),</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">of a user \(A\).</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">2. For a given number \(M\), counted how many users have followers and sub-followers</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">more than \(M\).</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">These tasks should be done in function. You may store whole follower network and</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">work with raw data provide in the data. A better approach would be create your</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">own data structure storing the information you need for the tasks, some kind of</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">preprocessing of the raw data. Feel free to create your structure via <code>class</code>.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Data format:</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">The first integer represents the number of all users \(N\). The following numbers</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">pair \(A B\) represents user \(A\) have followed \(B\), \(A\to B\). Example:</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">3 1 2 2 1 2 3</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">This example means there are 3 users in total, user #1 and #2 follow each other</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">and user #2 have followed user #3</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center"><span class="timestamp-wrapper"><span class="timestamp">&lt;2018-09-24 Mon&gt;</span></span></td>
<td class="left">Duplicate the matrix class in the guide, add one more function <code>print</code> to it.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="center">Assignment 3</td>
<td class="left">this <code>print</code> will output the matrix to a file. You may open the file outside or</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">inside the function. In other words, for Fortran, you may open the file outside and</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">pass the unit number of your file to the function or you may open the file inside</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">the function and close it when you exit, for C++, you may create the buffer</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">zone <code>ofstream</code> outside and pass the reference or you may create the buffer zone</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">inside the function. In practice open the file outside will be better.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="center"><span class="timestamp-wrapper"><span class="timestamp">&lt;2018-10-15 Mon&gt;</span></span></td>
<td class="left">Integrate the matrix class in the guide to a header file and an implementation file.</td>
</tr>

<tr>
<td class="center">&#xa0;</td>
<td class="left">Call your <code>print</code> function in your main funcion by loading this header file.</td>
</tr>

<tr>
<td class="center">Assignment 4</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Program</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Program 1</td>
<td class="left"><a href="https://en.wikipedia.org/wiki/Binary_serach_tree">Binary Serach Tree</a>:</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Implement a binary serach tree class with following feature:</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">1, Insert data (node) to an existing tree. Note that this tree are in general not balanced.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">2, Print out the tree by levels. Level \(k\) has at most \(2^{k-1}\) nodes. Print out the tree</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">by levels. Use * to represented null node.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Then for some series, insert the data to an empty tree in given order and print the final</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">tree. For example, for data \(\{4,2,3,8,5,6\}\), the print out would be</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">4</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">2 8</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">* 3 5 *</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">* * * * * 6 * *</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">Program 2</td>
<td class="left"><a href="https://en.wikipedia.org/wiki/Markov_chain">Markov Chain</a>:</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Markov Chain can be described by a transition matrix \(P\). The \(n\)-th state \(x(n)\) of an input</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">vector \(x(0)\) is given by</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">\[x(n)=x(0)P^n\]</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Implement an efficient method to compute the \(x(n)\) with given \(P\) and \(x(0)\). Analyze the</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">efficiency with resepct to \(n\), compare with the worst method you can come up with.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Generate a random \(P\) and \(x(0)\), run your code for different \(n\) and time your method with</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">the worst method. Check if the result is consistant with your analysis.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
