index.org
* Anouncements

|------------------+---------------------------------------------------------------------------------------|
| Date             | Announcement                                                                          |
|------------------+---------------------------------------------------------------------------------------|
| <2018-09-20 Thu> | The link to [[./resources/data/follower.txt][follower.txt]] has been fixed. The file contains 100 vertices and 500 edges |
|------------------+---------------------------------------------------------------------------------------|
| <2018-09-24 Mon> | A solution to Basel problem has been release. [[./resources/BaselProblem.zip][BaselProblem.zip]]                        |
|------------------+---------------------------------------------------------------------------------------|
| <2018-10-15 Mon> | 1. Assignments: here is the what you are expected to turn in:                         |
|                  |                                                                                       |
|                  | Assignment 1: a complete report with source code.                                     |
|                  | Assignment 2: your source code with some results, some txt file recording how many    |
|                  | users have $M$ follower and sub follower for a few $M$ is enough.                     |
|                  | Assignment 3 and 4: your source code with the header file and implementation file.    |
|                  |                                                                                       |
|                  | Program 1: Your source code with a result, a file print out the binary tree for some  |
|                  | input is enough.                                                                      |
|                  | Program 2: Your source code with the analysis on complexity. Compare your method's    |
|                  | efficiency with the worst method you can come up with. (short report needed)          |
|------------------+---------------------------------------------------------------------------------------|


#+html: </div>



