index.html




<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Anouncements</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Date</th>
<th scope="col" class="left">Announcement</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2018-09-20 Thu&gt;</span></span></td>
<td class="left">The link to <a href="./resources/data/follower.txt">follower.txt</a> has been fixed. The file contains 100 vertices and 500 edges</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2018-09-24 Mon&gt;</span></span></td>
<td class="left">A solution to Basel problem has been release. <a href="./resources/BaselProblem.zip">BaselProblem.zip</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2018-10-15 Mon&gt;</span></span></td>
<td class="left">1. Assignments: here is the what you are expected to turn in:</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Assignment 1: a complete report with source code.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Assignment 2: your source code with some results, some txt file recording how many</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">users have \(M\) follower and sub follower for a few \(M\) is enough.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Assignment 3 and 4: your source code with the header file and implementation file.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Program 1: Your source code with a result, a file print out the binary tree for some</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">input is enough.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">Program 2: Your source code with the analysis on complexity. Compare your method's</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">efficiency with the worst method you can come up with. (short report needed)</td>
</tr>
</tbody>
</table>


</div>
</div>
</div>
</div>
</body>
</html>
